app/Controllers/Dashboard.php

SELECT *
FROM `s1g_kategori`
WHERE `slug` = 'pantais-tr'
 LIMIT 1
---
    public function kategori_destinasi($slug)
    {
        $data['kategori'] = $this->KategoriModel->where([
            'slug' => $slug,
        ])->first();

SELECT *
FROM `s1g_kategori_acara`
WHERE `slug` = 'acara-tahunan'
 LIMIT 1
---
    public function kategori_acara($slug)
    {
        $data['kategori_acara'] = $this->KategoriAcara->where([
            'slug' => $slug,
        ])->first();