app/Models/AlbumPetaModel.php

SELECT *
FROM `s1g_album_peta`
JOIN `s1g_pariwisata` ON `s1g_pariwisata`.`id_pariwisata` =`s1g_album_peta`.`id_pariwisata`
---
    function get_album_wisata($where = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        if ($where != null) {
            $builder->where($where);
        }
        $builder->join('s1g_pariwisata', 's1g_pariwisata.id_pariwisata =' . $this->table . '.id_pariwisata');
        $query = $builder->get();

SELECT `s1g_pariwisata`.`id_pariwisata`, `s1g_pariwisata`.`nama_pariwisata`, COUNT(s1g_album_peta.id) as jml_album
FROM `s1g_album_peta`
RIGHT JOIN `s1g_pariwisata` ON `s1g_pariwisata`.`id_pariwisata` =`s1g_album_peta`.`id_pariwisata`
GROUP BY `s1g_pariwisata`.`id_pariwisata`
---
    function get_album_wisata_count()
    {
        $builder = $this->db->table($this->table);
        $builder->select('s1g_pariwisata.id_pariwisata,s1g_pariwisata.nama_pariwisata,COUNT(s1g_album_peta.id) as jml_album');
        $builder->join('s1g_pariwisata', 's1g_pariwisata.id_pariwisata =' . $this->table . '.id_pariwisata', 'right');
        $builder->groupBy('s1g_pariwisata.id_pariwisata');
        $query = $builder->get();