app/Models/AlbumAcaraModel.php

    function get_album_acara($where = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        if ($where != null) {
            $builder->where($where);
        }
        $builder->join('s1g_acara', 's1g_acara.id_acara =' . $this->table . '.id_acara');
        $query = $builder->get();
---
SELECT *
FROM `s1g_album_acara`
JOIN `s1g_acara` ON `s1g_acara`.`id_acara` =`s1g_album_acara`.`id_acara`

    function get_album_acara_count()
    {
        $builder = $this->db->table($this->table);
        $builder->select('s1g_acara.id_acara, s1g_acara.nama_tempat,COUNT(s1g_album_acara.id) as jml_album');
        $builder->join('s1g_acara', 's1g_acara.id_acara =' . $this->table . '.id_acara', 'right');
        $builder->groupBy('s1g_acara.id_acara');
        $query = $builder->get();
---
SELECT `s1g_acara`.`id_acara`, `s1g_acara`.`nama_tempat`, COUNT(s1g_album_acara.id) as jml_album
FROM `s1g_album_acara`
RIGHT JOIN `s1g_acara` ON `s1g_acara`.`id_acara` =`s1g_album_acara`.`id_acara`
GROUP BY `s1g_acara`.`id_acara`