app/Models/BookingAcara.php

    function list($where = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        if ($where != null) {
            $builder->where($where);
            $builder->join('s1g_kategori_acara', 's1g_kategori_acara.id_kategori_acara =' . $this->table . '.id_kategori_acara');
            $builder->join('s1g_user', 's1g_user.id_user =' . $this->table . '.id_user');
            $query = $builder->get();
            return $query->getRow();
        } else {
            $builder->join('s1g_kategori_acara', 's1g_kategori_acara.id_kategori_acara =' . $this->table . '.id_kategori_acara');
            $builder->join('s1g_user', 's1g_user.id_user =' . $this->table . '.id_user');
            $query = $builder->get();
---
SELECT *
FROM `s1g_booking_acara`
JOIN `s1g_kategori_acara` ON `s1g_kategori_acara`.`id_kategori_acara` =`s1g_booking_acara`.`id_kategori_acara`
JOIN `s1g_user` ON `s1g_user`.`id_user` =`s1g_booking_acara`.`id_user`