app/Models/FeedbackModel.php

    public function list()
    {
        return $this->db->table($this->table)->get()->getResult();
---
SELECT *
FROM `s1g_feedback`