app/Models/KategoriModel.php

    function get_kategori()
    {
        return $this->db->table($this->table)->get()->getResult('array');
---
SELECT *
FROM `s1g_kategori`