app/Models/KulinerModel.php

    function get_kuliner()
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        $query = $builder->get();
---
SELECT *
FROM `s1g_kuliner`