app/Models/ModelAcara.php

SELECT *
FROM `s1g_acara`
JOIN `s1g_kategori_acara` ON `s1g_kategori_acara`.`id_kategori_acara` =`s1g_acara`.`id_kategori_acara`
---
    function list($where = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        if ($where != null) {
            $builder->where($where);
            $builder->join('s1g_kategori_acara', 's1g_kategori_acara.id_kategori_acara =' . $this->table . '.id_kategori_acara');
            $query = $builder->get();
            return $query->getRow();
        } else {
            $builder->join('s1g_kategori_acara', 's1g_kategori_acara.id_kategori_acara =' . $this->table . '.id_kategori_acara');
            $query = $builder->get();

SELECT *
FROM `s1g_acara`
JOIN `s1g_kategori_acara` ON `s1g_kategori_acara`.`id_kategori_acara` =`s1g_acara`.`id_kategori_acara`
WHERE `s1g_kategori_acara`.`slug` = 'acara-tahunan'
SELECT `s1g_kategori_acara`.`id_kategori_acara`, `s1g_kategori_acara`.`slug`, `s1g_kategori_acara`.`kategori_acara`, COUNT(s1g_acara.id_kategori_acara) as jml_kat
FROM `s1g_acara`
JOIN `s1g_kategori_acara` ON `s1g_kategori_acara`.`id_kategori_acara` =`s1g_acara`.`id_kategori_acara`
GROUP BY `s1g_acara`.`id_kategori_acara`
---
    function get_kat_acara_count()
    {
        $builder = $this->db->table($this->table);
        $builder->select('s1g_kategori_acara.id_kategori_acara,s1g_kategori_acara.slug,s1g_kategori_acara.kategori_acara,COUNT(s1g_acara.id_kategori_acara) as jml_kat');
        $builder->join('s1g_kategori_acara', 's1g_kategori_acara.id_kategori_acara =' . $this->table . '.id_kategori_acara');
        $builder->groupBy('s1g_acara.id_kategori_acara');
        $query = $builder->get();