app/Models/PariwisataModel.php

    function get_wisata($where = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        if ($where != null) {
            $builder->where($where);
        }
        $builder->join('s1g_kategori', 's1g_kategori.id_kategori =' . $this->table . '.id_kategori');
        $query = $builder->get();
---
SELECT *
FROM `s1g_pariwisata`
JOIN `s1g_kategori` ON `s1g_kategori`.`id_kategori` =`s1g_pariwisata`.`id_kategori`

    function get_wisata_count()
    {
        $builder = $this->db->table($this->table);
        $builder->select('s1g_kategori.id_kategori,s1g_kategori.nama_kategori,s1g_kategori.slug,COUNT(s1g_pariwisata.id_kategori) as jml_kat');
        $builder->join('s1g_kategori', 's1g_kategori.id_kategori =' . $this->table . '.id_kategori');
        $builder->groupBy('s1g_pariwisata.id_kategori');
        $query = $builder->get();
---
SELECT `s1g_kategori`.`id_kategori`, `s1g_kategori`.`nama_kategori`, `s1g_kategori`.`slug`, COUNT(s1g_pariwisata.id_kategori) as jml_kat
FROM `s1g_pariwisata`
JOIN `s1g_kategori` ON `s1g_kategori`.`id_kategori` =`s1g_pariwisata`.`id_kategori`
GROUP BY `s1g_pariwisata`.`id_kategori`

    function getWhere_pariwisata($slug)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        $builder->join('s1g_kategori', 's1g_kategori.id_kategori =' . $this->table . '.id_kategori');
        $builder->where('s1g_pariwisata.id_pariwisata ', $slug);
        $query = $builder->get();
---
SELECT *
FROM `s1g_pariwisata`
JOIN `s1g_kategori` ON `s1g_kategori`.`id_kategori` =`s1g_pariwisata`.`id_kategori`
WHERE `s1g_pariwisata`.`id_pariwisata` = '52'