app/Models/PenginapanModel.php

SELECT *
FROM `s1g_penginapan`
---
    function get_penginapan($where = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        if ($where != null) {
            $builder->where($where);
            $query = $builder->get();
            return $query->getRow();
        } else {
            $query = $builder->get();